[
{"_id":{"$oid":"65c99c876392697fd94d73ff"},"Title":"Under the Silver Lake","Description":"This is a good movie. We will watch it soon.","Genre":{"Name":"Mystery","Description":"A mystery film is a genre of film that revolves around the solution of a problem or a crime."},"Director":{"Name":"David Robert Mitchell","Bio":"An American film director and writer. He received significant recognition as a director after completing his second feature, the critically acclaimed horror film It Follows."},"ImagePath":"underthesilverlake.png","Featured":true,"Actors":["Andrew Garfield"]},
{"_id":{"$oid":"65ca94586392697fd94d7400"},"Title":"Hellraiser","Description":"Hellraiser is a 1987 British supernatural horror film written and directed by Clive Barker, and produced by Christopher Figg, based on Barker's 1986 novella The Hellbound Heart. The film marked Barker's directorial debut. Its plot involves a mystical puzzle box that summons the Cenobites, a group of extra-dimensional, sadomasochistic beings who cannot differentiate between pain and pleasure. The leader of the Cenobites is portrayed by Doug Bradley, and identified in the sequels as 'Pinhead'.","Genre":{"Name":"Horror","Description":"A horror film is a genre of film seeking to elicit fear or horror from its audience."},"Director":{"Name":"Clive Barker","Bio":"An English playwright, novelist, film director, and visual artist best known for the horror series Hellraiser."},"ImagePath":"hellraiser.png","Featured":true,"Actors":["Doug Bradley","Clare Higgins"]},
{"_id":{"$oid":"65ca96a06392697fd94d7401"},"Title":"Rear Window","Description":"'Rear Window' is a classic 1954 American suspense thriller directed by Alfred Hitchcock. The film is based on Cornell Woolrich's 1942 short story 'It Had to Be Murder.' It stars James Stewart as a photographer who, confined to his apartment with a broken leg, becomes obsessed with watching the private dramas of his neighbors through his window. His voyeurism leads him and his girlfriend, played by Grace Kelly, to suspect one of his neighbors of murder.","Genre":{"Name":"Thriller / Mystery","Description":"Thriller and mystery films are genres that engage the viewer's suspense, excitement, and anticipation while solving a crime or unraveling mysteries."},"Director":{"Name":"Alfred Hitchcock","Bio":"An English film director and producer, widely regarded as one of the most influential filmmakers in the history of cinema. Known for his suspenseful and psychological thrillers."},"ImagePath":"rearwindow.png","Featured":true,"Actors":["James Stewart","Grace Kelly"]},
{"_id":{"$oid":"65ca9ac66392697fd94d7402"},"Title":"Memories of Murder","Description":"This film is based on the true story of Korea's first serial murders in history, which took place between 1986 and 1991 in Hwaseong, Gyeonggi Province. Directed by Bong Joon-ho, the story follows two detectives as they attempt to solve the crimes.","Genre":{"Name":"Crime, Drama","Description":"A film genre focusing on the dramatization of crime stories and complex psychological elements."},"Director":{"Name":"Bong Joon-ho","Bio":"A South Korean filmmaker known for his social themes and genre-bending films."},"ImagePath":"memoriesofmurder.png","Featured":true,"Actors":["Song Kang-ho","Kim Sang-kyung"]},
{"_id":{"$oid":"65ca9ae66392697fd94d7403"},"Title":"Baraka","Description":"A compelling non-narrative documentary, Baraka is a visually stunning montage of scenes capturing the essence of life around the globe, directed by Ron Fricke. The film is renowned for its powerful imagery, shot in 24 countries on six continents.","Genre":{"Name":"Documentary","Description":"A non-fictional film intended to document reality, primarily for the purposes of instruction, education, or maintaining a historical record."},"Director":{"Name":"Ron Fricke","Bio":"An American film director known for his work on documentary films that emphasize visual and musical artistry."},"ImagePath":"baraka.png","Featured":true,"Actors":[]},
{"_id":{"$oid":"65ca9b496392697fd94d7404"},"Title":"Zodiac","Description":"Zodiac follows the story of the manhunt for the Zodiac Killer, a serial murderer who terrorized the San Francisco Bay Area during the late 1960s and early '70s, sharing taunting letters and cryptic messages with the press. Directed by David Fincher, the film focuses on the obsessive quest of four men as they attempt to identify the notorious killer.","Genre":{"Name":"Crime, Drama","Description":"A film genre that focuses on crimes, their detection, criminals, and their motives."},"Director":{"Name":"David Fincher","Bio":"An American director and producer known for his psychological thrillers and meticulous craftsmanship."},"ImagePath":"zodiac.png","Featured":true,"Actors":["Jake Gyllenhaal","Robert Downey Jr."]},
{"_id":{"$oid":"65ca9bb96392697fd94d7405"},"Title":"Total Recall","Description":"Set in a future where memories and reality are malleable, Total Recall follows Douglas Quaid as he uncovers memories of being a spy after visiting a company that implants fake memories. Directed by Paul Verhoeven, the film is a blend of action, science fiction, and intricate plot twists.","Genre":{"Name":"Thriller","Description":"A genre that typically features a combination of action sequences and a futuristic or speculative technological backdrop."},"Director":{"Name":"Paul Verhoeven","Bio":"A Dutch director known for his provocative films and vivid storytelling in both science fiction and action genres."},"ImagePath":"totalrecall.png","Featured":true,"Actors":["Arnold Schwarzenegger","Sharon Stone"]},
{"_id":{"$oid":"65ca9c7a6392697fd94d7406"},"Title":"Thief","Description":"Thief is a gritty neo-noir film directed by Michael Mann, showcasing the life of a professional safecracker aiming for one last big heist before retiring. The film delves into themes of freedom, identity, and the elusive American dream.","Genre":{"Name":"Crime, Thriller","Description":"A genre that combines elements of crime with the suspenseful aspects of thrillers."},"Director":{"Name":"Michael Mann","Bio":"An American director known for his influential work in the crime genre and stylish visuals."},"ImagePath":"thief.png","Featured":true,"Actors":["James Caan","Tuesday Weld"]},
{"_id":{"$oid":"65ca9d2e6392697fd94d7407"},"Title":"Mulholland Drive","Description":"A surrealist tale that assembles fragments of dreams and reality, David Lynch's Mulholland Drive is a complex narrative of ambition, mystery, and identity in Los Angeles. The film follows an aspiring actress named Betty Elms, newly arrived in Los Angeles, who meets and befriends an amnesiac woman recovering from a car accident.","Genre":{"Name":"Thriller","Description":"A film genre that uses suspense, tension, and excitement as the main elements."},"Director":{"Name":"David Lynch","Bio":"An American filmmaker known for his surrealist films, he has developed his own unique cinematic style, known for its dream imagery and meticulous sound design."},"ImagePath":"mulhollanddrive.png","Featured":true,"Actors":["Naomi Watts","Laura Harring"]},
{"_id":{"$oid":"65ca9d796392697fd94d7408"},"Title":"Goodfellas","Description":"It's a real spicy meatball.","Genre":{"Name":"Crime","Description":"A film genre focused on crime, the criminal mindset, and the intricate workings of criminal organizations."},"Director":{"Name":"Martin Scorsese","Bio":"Martin Charles Scorsese is an American filmmaker. He emerged as one of the major figures of the New Hollywood era. Scorsese has received many accolades, including an Academy Award, four BAFTA Awards, three Emmy Awards, a Grammy Award, three Golden Globe Awards, and two Directors Guild of America Awards. He has been honored with the AFI Life Achievement Award in 1997, the Film Society of Lincoln Center tribute in 1998, the Kennedy Center Honor in 2007, the Cecil B. DeMille Award in 2010, and the BAFTA Fellowship in 2012. Five of his films have been inducted into the National Film Registry by the Library of Congress as /’culturally, historically or aesthetically significant/’."},"ImagePath":"goodfellas.png","Featured":true,"Actors":["Robert De Niro","Ray Liotta"]},
{"_id":{"$oid":"65ca9dbe6392697fd94d7409"},"Title":"The Wolf of Wall Street","Description":"Based on the true story of Jordan Belfort, The Wolf of Wall Street details his rise to a wealthy stockbroker living the high life and his subsequent fall involving crime, corruption, and the federal government. Directed by Martin Scorsese, the film explores themes of greed, excess, and the pursuit of the American dream.","Genre":{"Name":"Crime","Description":"A film genre that dramatizes the life of a non-fictional or historically-based person or people."},"Director":{"Name":"Martin Scorsese","Bio":"Martin Charles Scorsese is an American filmmaker. He emerged as one of the major figures of the New Hollywood era. Scorsese has received many accolades, including an Academy Award, four BAFTA Awards, three Emmy Awards, a Grammy Award, three Golden Globe Awards, and two Directors Guild of America Awards. He has been honored with the AFI Life Achievement Award in 1997, the Film Society of Lincoln Center tribute in 1998, the Kennedy Center Honor in 2007, the Cecil B. DeMille Award in 2010, and the BAFTA Fellowship in 2012. Five of his films have been inducted into the National Film Registry by the Library of Congress as /’culturally, historically or aesthetically significant/’."},"ImagePath":"thewolfofwallstreet.png","Featured":true,"Actors":["Leonardo DiCaprio","Jonah Hill"]}
]